import 'models.dart';

List<Category> categorys = [
  Category(id: 1, category: 'داستان و رمان'),
  Category(id: 2, category: 'سبک زندگی'),
  Category(id: 3, category: 'تاریخ'),
  Category(id: 4, category: 'روانشناسی'),
  Category(id: 5, category: 'هنر'),
  Category(id: 6, category: 'علمی'),
];

// List<dynamic> genres = [
//   {
//     'genre': 'اساطیری',
//   },
//   {
//     'genre': 'ترسناک',
//   },
//   {
//     'genre': 'تریلر',
//   },
//   {
//     'genre': 'جنایی و کارآگاهی',
//   },
//   {
//     'genre': 'رئالیسم جادویی',
//   },
//   {
//     'genre': 'عاشقانه',
//   },
//   {
//     'genre': 'علمی تخیلی',
//   },
//   {
//     'genre': 'فانتزی',
//   },
//   {
//     'genre': 'کمیک و گرافیکی',
//   },
//   {
//     'genre': 'کلاسیک',
//   },
//   {
//     'genre': 'ماجراجویی',
//   },
//   {
//     'genre': 'کمدی سیاه',
//   },
// ];

List<Book> books = [
  Book(
    id: 1,
    image: 'https://cdn.fidibo.com/images/books/4339_22364_normal.jpg',
    title: 'ملت عشق',
    text:
        'رمان ملت عشق در سال 2010 به دو زبان ترکی و انگلیسی منتشر شد و به محبوب‌ترین رمان تاریخ ترکیه و به یکی از پرخواننده‌ترین کتاب‌های جهان تبدیل شد. اثر شافاک شامل دو روایت موازی است، روایت معاصر در مورد زن خانه‌دارِ متاهل و ناخشنود به نام اِللا روبینشتاین است که در ماساچوست آمریکا زندگی می‌کند. اِللا برای آژانس ادبی کار می‌کند و در حال حاضر او بر روی کتابی به نام «کُفر شیرین» که توسط عزیز زاهارا نوشته شده است، کار می‌کند. داستان عزیر، روایت دوم این رمان است',
    author: 'ارسلان فصيحی',
    price: 48000,
    category: Category(id: 1, category: 'داستان و رمان'),
    star: '4.3',
  ),
  Book(
    id: 2,
    image: 'https://cdn.fidibo.com/images/books/64664_53966_normal.jpg',
    title: 'مردی به نام اوه',
    text:
        'رمان مردی به نام اوه عنوان اولین کتاب فردریک بک من است که به سی زبان دنیا ترجمه شده و به عنوان پرفروش‌ترین کتاب سال سوئد معروف شده است و در ایران نیز با ترجمه الناز فرحناکیان توسط نشر نون به چاپ رسیده است. در ادامه با ما همراه باشید تا با معرفی این کتاب جذاب که از پرفروش‌ترین‌های سایت آمازون در سال 2016 نیز به حساب می آید شما را با دنیای نویسندگی فردریک بک من آشنا کنیم.',
    author: 'الناز فرحناکیان',
    price: 25000,
    category: Category(id: 1, category: 'داستان و رمان'),
    star: '4',
  ),
  Book(
    id: 3,
    image: 'https://cdn.fidibo.com/images/books/7345_72625_normal.jpg',
    title: 'هری پاتر و فرزند نفرین شده',
    text:
        'جناب آقای حجت گلابی هم از مترجمان کتاب هستند که به دلیل محدودیت در درج تعداد مترجم نام آنها در بالا ذکر نشده است ایستگاه شلوغ و مملو از جمعیت است. آدم‌های بسیاری در ایستگاه هستند که هر کدام می‌خواهند برای خود جایی بروند. در بین این فشار و شلوغی، دو قفس بزرگ بر روی دو چرخ‌دستی سنگین، تلق و تلوق می‌کنند. این چرخ‌دستی‌ها توسط دو پسر به نام‌های جیمز پاتر و آلبوس پاتر کشیده می‌شوند که مادر آنها، جینی، هم به دنبالشان در حال حرکت است. مردی سی و هفت ساله به نام هری، دختر خود، لی‌لی را بر روی شانه‌هایش حمل می‌کند. آلبوس: بابا، همش داره این حرف رو می‌زنه. هری: جیمز، بس می‌کنی؟ جیمز: فقط گفتم شاید بیفته اسلیترین. و شاید... (پدرش به او چشم غره می‌رود) باشه. آلبوس: (به مادرش نگاه می‌کند) برام نامه می‌نویسین دیگه، نه؟ جینی: اگر بخوای هر روز برات نامه می‌فرستیم. آلبوس: نه. هر روز نمی‌خواد. جیمز میگه بیشتر بچه‌ها فقط ماهی یه بار از خونه بهشون نامه می‌فرستن. نمی‌خوام که... هری: سال پیش برای برادرت هفته‌ای سه تا نامه می‌فرستادیم. آلبوس: چی؟ جیمز!',
    author: 'جان تیفانی',
    price: 40000,
    category: Category(id: 1, category: 'داستان و رمان'),
    star: '4.8',
  ),
  Book(
    id: 4,
    image: 'https://cdn.fidibo.com/images/books/1631_63289_normal.jpg',
    title: 'سمفونی مردگان',
    text:
        'داستان از کاروانسرای آجیل فروشها در اردبیل آغاز می شود که توسط مردی به شدت سنت گرا و تحت تاثیر عقاید قدیمی مذهبی گردانده میشود. رمان سمفونی مردگان درباره خانواده این مرد آجیل فروش است که 4 فرزند دارد. فرزند اولش یوسف نام دارد که طی سانحه ای که خودش مقصر آن به حساب میآمده، از همان ابتدای داستان مانند تکه گوشتی گوشه خانه افتاده است و زندگی نکبت باری دارد؛ چرا که نه می تواند زندگی کند و نه اختیاری برای مرگ خود دارد. حتی در قسمتی از داستان و حین سیمکشی خانه با اینکه یوسف داخل اتاق بود و همه از مرگ حتمی او حرف میزدند باز هم جان سالم به در برد و به زندگی بدون زنده بودنش ادامه داد.',
    author: 'عباس معروفی‌',
    price: 39000,
    category: Category(id: 1, category: 'داستان و رمان'),
    star: '3.7',
  ),
  Book(
    id: 5,
    image: 'https://cdn.fidibo.com/images/books/79813_36988_normal.jpg',
    title: 'تختت را مرتب کن',
    text:
        'بیشتر افراد امیدوارند که جهان را تغییر بدهند و آن را نجات دهند. آن‌ها می‌خواهند دنیا را به مکانی امن‌تر و شادتر برای زندگی تبدیل کنند. اما موضوعی که قبل از هر نکته‌ای برای شروع مهم است شروع تغییر از خود است. نیاز به کاری فوق‌العاده نیست، تنها کافی است هرکس با انجام کارها و اصولی ساده زندگی و دنیای خودش را اندکی بهبود دهد. این کارها می‌تواند به سادگی و کوچکی مرتب کردن تخت‌‌خوابی باشد. در کتاب تختت را مرتب کن نوشته‌ی ویلیام اچ. مک‌ریون اصول کاربردی و کوچکی برای تحول زندگی آموزش داده می‌شود.',
    author: 'ویلیام اچ.مک‌ریون',
    price: 4000,
    category: Category(id: 2, category: 'سبک زندگی'),
    star: '2.4',
  ),
  Book(
    id: 6,
    image: 'https://cdn.fidibo.com/images/books/4292_39439_normal.jpg',
    title: 'کتاب مثل یک مرد فکر کن، مثل یک زن رفتار کن',
    text:
        'هیچ‌چیز در این سیاره نمی‌تواند با عشق یک زن مقایسه شود. مهربانی و دلسوزی، صبوری و سخاوت بی‌قیدوشرط مشخصه‌های بارز زنی است که می‌خواهد رابطه‌ی خود را شروع و آن را با عشق و علاقه حفظ کند؛ اما گاهی زنان علت بعضی رفتارهای مردان را نمی‌دانند و آن‌ها را نوعی بی‌احترامی تلقی می‌کنند. استیو هاروی کمدین معروف آمریکایی در کتاب مثل یک مرد فکر کن مثل یک زن رفتار کن  با زبان شیرین و طنز خاص خود از حقایق و تجربیات شخصی‌اش استفاده کرده تا به زنان کمک کند که بدانند آقایان هنگام رابطه، صمیمیت و عشق چطور فکر می‌کنند. این کتاب تا مدت‌ها در فهرست پرفروش‌های نیویورک‌تامیز قرار داشت و به زنان زیادی در سراسر جهان کمک کرده است تا مشکلات رابطه‌شان را حل کنند.',
    author: 'استیو هاروی',
    price: 12000,
    category: Category(id: 2, category: 'سبک زندگی'),
    star: '4.1',
  ),
  Book(
    id: 7,
    image: 'https://cdn.fidibo.com/images/books/79101_10945_normal.jpg',
    title: 'صبح جادویی',
    text:
        'تجربه‌ی نزدیک به مرگ، اتفاقی است که هر فرد به شکل متفاوتی با آن مواجه می‌شود. اما نقطه اشتراک این افراد تحولی است که در ذهن، روان و روند زندگی‌شان ایجاد می‌شود. گاهی این تحول به تغییرات فردی محدود می‌شود و گاه در حدی ‌است که توجه جهانی را به خود جلب می‌کند. هال الرود یکی از کسانی‌ست که این تجربه به نقطه عطف زندگی‌اش تبدیل شد و فعالیت‌های او در زمینه‌ی موفقیت را با افراد دیگر متمایز کرد. کتاب صبح جادویی اهمیت سحرخیزی و راه‌کارهایی برای شروع روز با تمام قدرت ذهنی و جسمی را برای مخاطب شرح می‌دهد.',
    author: 'هال الرود',
    price: 15000,
    category: Category(id: 2, category: 'سبک زندگی'),
    star: '3.6',
  ),
  Book(
    id: 8,
    image: 'https://cdn.fidibo.com/images/books/1009_46956_normal.jpg',
    title: 'نبرد من',
    text:
        'شکی در این نیست که آدولف هیتلر یکی از تأثیرگذارترین سیاست‌مداران و رهبران قرن بیستم بوده است. کمتر کسی اسم این دیکتاتور را نشنیده است و از نحوه‌ی حکومت او بر آلمان بی‌خبر است. هیتلر در سال ۱۹۳۳ به عنوان صداعظم آلمان انتخاب شد و در نهایت در سال ۱۹۳۴ زمانی که با مرگ فن هیندنبورگ اختیارات رئیس‌جمهور نیز به او اعطا شد،‌ بطور رسمی رهبری آلمان را به عهده گرفت. این سرجوخه سابق آلمان، زمانی که به خاطر کودتا در قلعه‌ی لندربرگ زندانی بود شروع به نوشتن کتابی کرد تا مانیفست اندیشه سیاسی خود را مکتوب کند. این کتاب که بعدها «نبرد من» نام گرفت، پایه‌ی برپایی حزب ناسیونالیسم آلمان شد و به کتاب مقدس حکومت نازی تبدیل شد.',
    author: 'آدولف هيتلر',
    price: 30000,
    category: Category(id: 3, category: 'تاریخ'),
    star: '4.5',
  ),
  Book(
    id: 9,
    image: 'https://cdn.fidibo.com/images/books/67093_46260_normal.jpg',
    title: 'چهار اثر فلورانس اسکاول شین',
    text:
        'در بهبوهه زندگی و در زمانی‌که هر روز در معرض اخبار منفی هستید، در روزهایی که مشکلات روی هم انبار شده و شما انرژی خود را از دست داده‌اید، در تمام لحظات طاقت‌فرسای زندگی، چه چیزی بیشتر از یک کتاب معجزه‌گر می‌تواند حال‌تان را خوب کند و راه را نشان‌تان دهد؟ اینجا همان جایی‌ست که باید یک لحظه توقف کنید، از هرج و مرج بیرون بیایید و از اندیشه‌های کتاب چهار اثر از فلورانس اسکاول شین کمک بگیرید. کتابی که قرار است درباره آن بخوانید، زندگی شما را زیر و رو خواهد کرد و راه درست را نشان‌تان خواهد داد.',
    author: 'نشمیل مشتاق',
    price: 30000,
    category: Category(id: 4, category: 'روانشناسی'),
    star: '3.9',
  ),
  Book(
    id: 10,
    image: 'https://cdn.fidibo.com/images/books/3922_17031_normal.jpg',
    title: 'معجزه انضباط فردی',
    text:
        'نویسندگان را معمولا با نام کتاب‌هایشان می‌شناسند و کمتر پیش می‌آید چهره‌ی نویسنده‌ای به اندازه‌ی کتاب‌هایش مشهور باشد. اما در روزگاری که بازار انتشار کتاب‌های موفقیت و روانشناسی – خودشناسی داغ است برایان تریسی دقیقا همان مردی است که چهره‌اش را بلافاصله بعد از وارد شدن به کتاب‌فروشی‌ها می‌بینید. این بار برایان تریسی در کتاب معجزه‌ی انضباط فردی راهکارهایی را برای رهایی از تنبلی و تن‌پروری ارائه می‌دهد.',
    author: 'برایان تریسی',
    price: 5000,
    category: Category(id: 4, category: 'روانشناسی'),
    star: '2',
  ),
];

List<Book> favorits = [
  Book(
    id: 1,
    image: 'https://cdn.fidibo.com/images/books/4339_22364_normal.jpg',
    title: 'ملت عشق',
    text:
        'رمان ملت عشق در سال 2010 به دو زبان ترکی و انگلیسی منتشر شد و به محبوب‌ترین رمان تاریخ ترکیه و به یکی از پرخواننده‌ترین کتاب‌های جهان تبدیل شد. اثر شافاک شامل دو روایت موازی است، روایت معاصر در مورد زن خانه‌دارِ متاهل و ناخشنود به نام اِللا روبینشتاین است که در ماساچوست آمریکا زندگی می‌کند. اِللا برای آژانس ادبی کار می‌کند و در حال حاضر او بر روی کتابی به نام «کُفر شیرین» که توسط عزیز زاهارا نوشته شده است، کار می‌کند. داستان عزیر، روایت دوم این رمان است',
    author: 'ارسلان فصيحی',
    price: 48000,
    category: Category(id: 1, category: 'داستان و رمان'),
    star: '4.3',
  ),
  Book(
    id: 2,
    image: 'https://cdn.fidibo.com/images/books/64664_53966_normal.jpg',
    title: 'مردی به نام اوه',
    text:
        'رمان مردی به نام اوه عنوان اولین کتاب فردریک بک من است که به سی زبان دنیا ترجمه شده و به عنوان پرفروش‌ترین کتاب سال سوئد معروف شده است و در ایران نیز با ترجمه الناز فرحناکیان توسط نشر نون به چاپ رسیده است. در ادامه با ما همراه باشید تا با معرفی این کتاب جذاب که از پرفروش‌ترین‌های سایت آمازون در سال 2016 نیز به حساب می آید شما را با دنیای نویسندگی فردریک بک من آشنا کنیم.',
    author: 'الناز فرحناکیان',
    price: 25000,
    category: Category(id: 1, category: 'داستان و رمان'),
    star: '4',
  ),
];
